Autodesk.Revit.DB.ViewDisplayBackgroundType
A collection of settings defining the type of the view background
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackgroundType.SunAndClouds
Best approximation to the colors of the sky and the visible sun disk.
The position of the visible sun disk is calculated based on the "sun and shadow settings"
(see 'ViewBackgroundLighting' object).

Autodesk.Revit.DB.ViewDisplayBackgroundType.Image
User-specified image is drawn in the background either stretched
vertically/horizontally/in both directions, or as is (pixel-to-pixel).

Autodesk.Revit.DB.ViewDisplayBackgroundType.Gradient
Three-color simulated sky-horizon-ground combination.  The sky is
drawn in gradually changing color from the top (the "sky" color) to the
bottom (the "horizon" color).  The ground is either drawn in the single
(the "ground") color, if the sky is visible, or in a gradient from the top
(the "horizon") color to the bottom (the "ground") color.

Autodesk.Revit.DB.ViewDisplayBackgroundType.None
No background defined - the color from Options is used to fill it.